Revit 2026 API

# FamilyInstancePlacingArgsTooltipMessage Property

---

The message to be shown via tooltip

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string TooltipMessage { get; set; }
```
```vb
Public Property TooltipMessage As String
	Get
	Set
```
```cpp
public:
property String^ TooltipMessage {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member TooltipMessage : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

FamilyInstancePlacingArgs Class

Autodesk.Revit.UI Namespace